{
    "h": "entry",
    "content": "# Second passport obtained\n\nI successfully obtained a second UK passport today with suspiciously little difficulty, but this is doubtless due to helpful advice I got from [Phil](http://philarcher.org/diary/2016/secondpassport/) and [this blog](http://pointstobemade.boardingarea.com/2014/10/15/getting-2nd-passport-using-uk-passport-premium-service/) beforehand. There is no official information about how to do this online, and only a little around blogs and forums, so I'm contributing my experience to the pile.\n\nDue to travel and living outside of the UK, there was no time to wait for the postal turnaround and only a single day I could be in London in person before I needed it, so I had to go for the Premium service. This, plus an extra large size passport, cost &pound;139. I made my interview appointment and paid online, just over two weeks in advance.\n\nI called the passport adviceline to check a foreign employer was eligible to sign the supporting letter, as I'd read on a forum that they wouldn't be, but that was no problem. I asked someone with a sufficiently impressive sounding job title in my research group at MIT to sign a letter saying I need an additional passport to make frequent work-related travel possible (which is true). Officially the letter is required to be signed by a 'senior manager', which academia doesn't really have obvious job titles for, and I didn't think a Professor would cut it as far as the Passport Office is concerned. Fortunately there are a few people who are my superiors, if not directly above me in the chain (I don't know what the org chart looks like tbh) who have 'Director' in their title. That worked.\n\nAs Phil points out in his post, the letter has to state that *frequent* travel either hinders access to send-away-for visas, or involves countries who deny entry if you've previously visited certain other countries; they don't give them out for one-offs. And the letter has to have a 'wet' signature, not be a printout or photocopy. And has to be on headed paper. I had it printed on extra thick fancy paper for good measure.\n\nI also had to have one of my passport photos countersigned by a professional who had known me for 2 years, who also had to fill in section 10 of the application form. This is the same as for first time passports, but *not* renewals. Some forum posts about this suggested you should follow the renewals process for a second passport, but this is where it varied. My PhD supervisor did this.\n\nMinor last minute panic around realising I was missing my supervisor's passport number and my parents' passport issue dates the night before, but they all replied to me in time.\n\nI showed up at the passport office in Victoria just after 0900 for a 0915 appointment. You can take anything you want in, but it goes through a security scanner like at an airport (in contrast to the US embassy where I got my visa, which didn't allow laptops). I was issued issued a queue ticket which said 'outstanding: &pound;128' on it which worried me slightly. Less than a 10 minute wait before my 'interview'. The first thing I said was that I was applying for a 2nd passport for business travel, not a renewal (which is what I'd selected when I booked the interview online). The interviewer asked me about how I'd booked and paid, because he could see I'd paid online but some other system hadn't registered it (hence the 'outstanding' on my ticket). He was kind enough not to charge me again. He ran his finger over the signature on the letter to check it was 'wet', read through my application form and filled in section 1 for me (I left it blank because there is no option for '2nd passport'); I didn't see what he put, but at the end he showed me that he'd written 'DO NOT CANCEL ORIGINAL' somewhere. He flipped through my passport and asked me to show him the stamp for the country that would be preventing me from getting into a different country. I was pleased my passport is already packed full of stamps and visas, leaving him in no doubt of my 'frequent traveller' status. I was not asked for proof of travel, but my letter contained the start and end dates of my next trip.\n\nAaand... that was it. \n\nI went back to the collection point 4 hours and 20 minutes later (after a fancy expensive breakfast at Le Pain Quotidien around the corner, who I know to count on for power and wifi and whose menu has exploded with vegan options since I was last here, and a jaunt to the British Library) with the receipt, and they handed my shiny new 48 page one over!",
    "category": [
        "travel",
        "passport",
        "uk",
        "bureaucracy",
        "london"
    ],
    "@context": "http://rhiaro.co.uk/vocab",
    "published": "2016-02-27T17:09:20+00:00",
    "http://purl.org/dc/terms/title": "Second passport obtained",
    "@id": "http://blog.rhiaro.co.uk/second-passport",
    "http://xmlns.com/foaf/0.1/isPrimaryTopicOf": {
        "@id": "http://rhiaro.co.uk/2016/02/second-passport"
    },
    "http://purl.org/dc/terms/created": {
        "@value": "2016-02-27T17:09:20+00:00",
        "@type": "xsd:dateTime"
    }
}