{
    "h": "entry",
    "content": "# Montreal 01\r\n\r\nI'm sitting in a park, as Montreal beeps and rumbles and chatters around me. I can ear a helicopter passing. The clacking of skateboards. The sky is inky black, stars drowned by city lights. A circling spotlight peeks between skyscrapers every few seconds. A city like many others. It's rough around the edges, but seems stable enough. Rough enough not to make me suspicious of it, like Tokyo or Doha. Stable enough to make me content there alone, unlike Cairo or Delhi. Maybe if Edinburgh grew skyscrapers it would be like this.\r\n\r\nIt's more French than I was for some reason expecting; primarily French. I understand when people speak to me - eventually. It takes a few extra seconds to process, and by that time they've realised and switched to English.\r\n\r\nToday I went to the botanical gardens. A blue and black papillon landed on me, and a green stick insect climbed my hand. I watched my beetle alter-ego fly repeatedly into glass, flounder with its legs in the air for a while, before righting itself and proceeding to bury itself completely with dirt. I walked through artificial environments which supported plants that shouldn't be there. Diverse bits of the world gathered together in one place, entombed in glass, for $14.50. There wasn't much alive outside. Instead of playing rainforest make-believe, I took some photos of plants alongside the human-built infrastructure that kept them alive.\r\n\r\nI ate: an apple pastry from Sophie Sucree; pea soup from the gardens' restaurant; three fresh samosas from a tiny Indian place; brown sticky rice with edamame, carrot, ginger, avocado, cucumber, watercress and tempeh from Nutrimania.\r\n\r\nI saw McGill campus, Parc la Fontaine, and many streets. After dark, I walked through Place des Artes, and here I am.",
    "category": [
        "travel",
        "canada",
        "montreal",
        "food"
    ],
    "@context": "http://rhiaro.co.uk/vocab",
    "published": "2016-04-21T15:41:05+01:00",
    "http://purl.org/dc/terms/title": "Montreal 01\r",
    "@id": "http://blog.rhiaro.co.uk/montreal-01",
    "http://xmlns.com/foaf/0.1/isPrimaryTopicOf": {
        "@id": "http://rhiaro.co.uk/2016/04/montreal-01"
    },
    "http://purl.org/dc/terms/created": {
        "@value": "2016-04-21T15:41:05+01:00",
        "@type": "xsd:dateTime"
    }
}